In [1]:
import pandas as pd

In [2]:
#load data
raw_data = pd.read_csv("titanic_full.csv")

In [3]:
raw_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
#shape
len(raw_data)

891

In [5]:
raw_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
raw_data.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [7]:
raw_data[['Name', 'Age']].head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [8]:
raw_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
clean_data = raw_data.drop("Cabin" , axis=1)

In [10]:
clean_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [11]:
clean_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [12]:
clean_data.Age.mean()

29.69911764705882

In [13]:
clean_data.Age.mode()

0    24.0
Name: Age, dtype: float64

In [14]:
median_age=clean_data.Age.median()

In [15]:
clean_data["Age"] = clean_data['Age'].fillna(median_age)

In [16]:
clean_data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [17]:
clean_data["Embarked"] = clean_data['Embarked'].fillna('U')

In [18]:
clean_data.Embarked

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [19]:
clean_data.to_csv('clean_data_titanic.csv', index= False)

preprocessing data for model building

In [20]:
preprocessed_data = pd.read_csv('clean_data_titanic.csv')

In [21]:
preprocessed_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [22]:
gender_columns= pd.get_dummies(preprocessed_data['Sex'], prefix='sex')

In [23]:
gender_columns.head()

   sex_female  sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [24]:
embarked_columns= pd.get_dummies(preprocessed_data['Embarked'], prefix='embarked')

In [25]:
embarked_columns.head()

   embarked_C  embarked_Q  embarked_S  embarked_U
0           0           0           1           0
1           1           0           0           0
2           0           0           1           0
3           0           0           1           0
4           0           0           1           0

In [26]:
preprocessed_data = pd.concat([preprocessed_data, gender_columns],axis=1)

In [27]:
preprocessed_data = pd.concat([preprocessed_data, embarked_columns], axis=1)

In [28]:
preprocessed_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,sex_female,sex_male,embarked_C,embarked_Q,embarked_S,embarked_U
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0,1,0,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1,0,1,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1,0,0,0,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1,0,0,0,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0,1,0,0,1,0

In [29]:

first_class = preprocessed_data[preprocessed_data.Pclass == 1]

In [30]:
sum(first_class['Survived'])/len(first_class) *100

62.96296296296296

In [31]:
second_class = preprocessed_data[preprocessed_data.Pclass == 2]

In [32]:
sum(second_class['Survived'])/len(second_class) *100

47.28260869565217

In [33]:

third_class = preprocessed_data[preprocessed_data.Pclass == 3]

In [34]:
sum(second_class['Survived'])/len(third_class) *100

17.718940936863543

In [35]:
#to drop : preprocessed_data = preprocessed_data.drop(['Name', 'Sex', 'Embarked','Ticket'], axis=1 )

In [56]:
preprocessed_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,sex_female,sex_male,embarked_C,embarked_Q,embarked_S,embarked_U
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,0,1,0,0,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,1,0,1,0,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,1,0,0,0,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,1,0,0,0,1,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,0,1,0,0,1,0

In [37]:
preprocessed_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked', 'sex_female', 'sex_male',
       'embarked_C', 'embarked_Q', 'embarked_S', 'embarked_U'],
      dtype='object')

In [74]:
preprocessed_data = preprocessed_data.drop('Sex', axis=1)

MODEL BUILDING

In [75]:
features = preprocessed_data.drop('Survived', axis=1)
label = preprocessed_data['Survived']

In [76]:
features.columns

Index(['PassengerId', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked',
       'sex_female', 'sex_male', 'embarked_C', 'embarked_Q', 'embarked_S',
       'embarked_U'],
      dtype='object')

In [77]:
label

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [78]:
pip install --upgrade pip

Requirement already satisfied: pip in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (22.2.2)
Note: you may need to restart the kernel to use updated packages.

In [1]:
pip install sklearn

Collecting sklearn
  Downloading sklearn-0.0.tar.gz (1.1 kB)
  Preparing metadata (setup.py) ... done
Collecting scikit-learn
  Downloading scikit_learn-1.1.2-cp310-cp310-macosx_10_9_x86_64.whl (8.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.7/8.7 MB 232.5 kB/s eta 0:00:0000:0100:02
Collecting joblib>=1.0.0
  Downloading joblib-1.1.0-py2.py3-none-any.whl (306 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 307.0/307.0 kB 182.4 kB/s eta 0:00:00a 0:00:01
Collecting threadpoolctl>=2.0.0
  Downloading threadpoolctl-3.1.0-py3-none-any.whl (14 kB)
Requirement already satisfied: numpy>=1.17.3 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from scikit-learn->sklearn) (1.23.1)
Requirement already satisfied: scipy>=1.3.2 in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (from scikit-learn->sklearn) (1.8.1)
Using legacy 'setup.py install' for sklearn, since package 'wheel' is not installed.
Installing collected packages: threadpoolctl, joblib, scikit-learn, sklearn
  Running setup.py install for sklearn ... done
Successfully installed joblib-1.1.0 scikit-learn-1.1.2 sklearn-0.0 threadpoolctl-3.1.0
Note: you may need to restart the kernel to use updated packages.

In [79]:
from sklearn.model_selection import train_test_split

In [80]:
features_train, features_test, label_train, label_test = train_test_split(features,label, test_size=0.4, random_state=42)

In [81]:
features_train.shape

(534, 13)

In [82]:
features_test.shape

(357, 13)

In [83]:
label_train.shape

(534,)

In [84]:
label_test.shape

(357,)

In [85]:
features_validation, features_val_test, label_validation, label_val_test = train_test_split(features_test, label_test, test_size=0.5, random_state=42)

In [86]:
from sklearn.naive_bayes import GaussianNB

In [87]:
features_train.head()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,Embarked,sex_female,sex_male,embarked_C,embarked_Q,embarked_S,embarked_U
570,571,2,62.0,0,0,10.5000,S,0,1,0,0,1,0
787,788,3,8.0,4,1,29.1250,Q,0,1,0,1,0,0
74,75,3,32.0,0,0,56.4958,S,0,1,0,0,1,0
113,114,3,20.0,1,0,9.8250,S,1,0,0,0,1,0
635,636,2,28.0,0,0,13.0000,S,1,0,0,0,1,0

In [94]:
nb_model = GaussianNB

In [95]:
nb_model.fit(features_train, label_train)

TypeError: GaussianNB.fit() missing 1 required positional argument: 'y'